ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p55x_mcan_regs.xml
	<register id="MCAN_IE" width="32" page="1" offset="0x54" internal="0" description="MCAN Interrupt Enable">
		<bitfield id="RF0NE" description="Rx FIFO 0 New Message Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RF0WE" description="Rx FIFO 0 Watermark Reached Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RF0FE" description="Rx FIFO 0 Full Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RF0LE" description="Rx FIFO 0 Message Lost Enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RF1NE" description="Rx FIFO 1 New Message Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="RF1WE" description="Rx FIFO 1 Watermark Reached Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="RF1FE" description="Rx FIFO 1 Full Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="RF1LE" description="Rx FIFO 1 Message Lost Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="HPME" description="High Priority Message Enable" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="TCE" description="Transmission Completed Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="TCFE" description="Transmission Cancellation Finished Enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="TFEE" description="Tx FIFO Empty Enable" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="TEFNE" description="Tx Event FIFO New Entry Enable" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="TEFWE" description="Tx Event FIFO Watermark Reached Enable" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TEFFE" description="Tx Event FIFO Full Enable" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="TEFLE" description="Tx Event FIFO Element Lost Enable" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="TSWE" description="Timestamp Wraparound Enable" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="MRAFE" description="Message RAM Access Failure Enable" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="TOOE" description="Timeout Occurred Enable" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="DRXE" description="Message Stored to Dedicated Rx Buffer Enable" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="BECE" description="Bit Error Corrected Enable" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="BEUE" description="Bit Error Uncorrected Enable" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="ELOE" description="Error Logging Overflow Enable" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="EPE" description="Error Passive Enable" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="EWE" description="Warning Status Enable" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="BOE" description="Bus_Off Status Enable" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="WDIE" description="Watchdog Interrupt Enable" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="PEAE" description="Protocol Error in Arbitration Phase Enable" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="PEDE" description="Protocol Error in Data Phase Enable" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="ARAE" description="Access to Reserved Address Enable" begin="29" end="29" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAN_ILS" width="32" page="1" offset="0x58" internal="0" description="MCAN Interrupt Line Select">
		<bitfield id="RF0NL" description="Rx FIFO 0 New Message Line" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RF0WL" description="Rx FIFO 0 Watermark Reached Line" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RF0FL" description="Rx FIFO 0 Full Line" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RF0LL" description="Rx FIFO 0 Message Lost Line" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RF1NL" description="Rx FIFO 1 New Message Line" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="RF1WL" description="Rx FIFO 1 Watermark Reached Line" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="RF1FL" description="Rx FIFO 1 Full Line" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="RF1LL" description="Rx FIFO 1 Message Lost Line" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="HPML" description="High Priority Message Line" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="TCL" description="Transmission Completed Line" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="TCFL" description="Transmission Cancellation Finished Line" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="TFEL" description="Tx FIFO Empty Line" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="TEFNL" description="Tx Event FIFO New Entry Line" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="TEFWL" description="Tx Event FIFO Watermark Reached Line" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TEFFL" description="Tx Event FIFO Full Line" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="TEFLL" description="Tx Event FIFO Element Lost Line" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="TSWL" description="Timestamp Wraparound Line" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="MRAFL" description="Message RAM Access Failure Line" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="TOOL" description="Timeout Occurred Line" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="DRXL" description="Message Stored to Dedicated Rx Buffer Line" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="BECL" description="Bit Error Corrected Line" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="BEUL" description="Bit Error Uncorrected Line" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="ELOL" description="Error Logging Overflow Line" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="EPL" description="Error Passive Line" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="EWL" description="Warning Status Line" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="BOL" description="Bus_Off Status Line" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="WDIL" description="Watchdog Interrupt Line" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="PEAL" description="Protocol Error in Arbitration Phase Line" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="PEDL" description="Protocol Error in Data Phase Line" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="ARAL" description="Access to Reserved Address Line" begin="29" end="29" width="1" rwaccess="RW"/>
	</register>
