ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p55x_mcan_regs.xml
	<register id="MCAN_TXBTIE" width="32" page="1" offset="0xe0" internal="0" description="MCAN Tx Buffer Transmission Interrupt Enable">
		<bitfield id="TIE0" description="Transmission Interrupt Enable 0" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TIE1" description="Transmission Interrupt Enable 1" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TIE2" description="Transmission Interrupt Enable 2" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TIE3" description="Transmission Interrupt Enable 3" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TIE4" description="Transmission Interrupt Enable 4" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TIE5" description="Transmission Interrupt Enable 5" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="TIE6" description="Transmission Interrupt Enable 6" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TIE7" description="Transmission Interrupt Enable 7" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TIE8" description="Transmission Interrupt Enable 8" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="TIE9" description="Transmission Interrupt Enable 9" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="TIE10" description="Transmission Interrupt Enable 10" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="TIE11" description="Transmission Interrupt Enable 11" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="TIE12" description="Transmission Interrupt Enable 12" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="TIE13" description="Transmission Interrupt Enable 13" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TIE14" description="Transmission Interrupt Enable 14" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="TIE15" description="Transmission Interrupt Enable 15" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="TIE16" description="Transmission Interrupt Enable 16" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="TIE17" description="Transmission Interrupt Enable 17" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="TIE18" description="Transmission Interrupt Enable 18" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="TIE19" description="Transmission Interrupt Enable 19" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="TIE20" description="Transmission Interrupt Enable 20" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="TIE21" description="Transmission Interrupt Enable 21" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="TIE22" description="Transmission Interrupt Enable 22" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="TIE23" description="Transmission Interrupt Enable 23" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="TIE24" description="Transmission Interrupt Enable 24" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="TIE25" description="Transmission Interrupt Enable 25" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="TIE26" description="Transmission Interrupt Enable 26" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="TIE27" description="Transmission Interrupt Enable 27" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="TIE28" description="Transmission Interrupt Enable 28" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="TIE29" description="Transmission Interrupt Enable 29" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="TIE30" description="Transmission Interrupt Enable 30" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="TIE31" description="Transmission Interrupt Enable 31" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAN_TXBCIE" width="32" page="1" offset="0xe4" internal="0" description="MCAN Tx Buffer Cancellation Finished Interrupt Enable">
		<bitfield id="CFIE0" description="Cancellation Finished Interrupt Enable 0" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CFIE1" description="Cancellation Finished Interrupt Enable 1" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CFIE2" description="Cancellation Finished Interrupt Enable 2" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CFIE3" description="Cancellation Finished Interrupt Enable 3" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CFIE4" description="Cancellation Finished Interrupt Enable 4" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CFIE5" description="Cancellation Finished Interrupt Enable 5" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CFIE6" description="Cancellation Finished Interrupt Enable 6" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CFIE7" description="Cancellation Finished Interrupt Enable 7" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CFIE8" description="Cancellation Finished Interrupt Enable 8" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CFIE9" description="Cancellation Finished Interrupt Enable 9" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CFIE10" description="Cancellation Finished Interrupt Enable 10" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CFIE11" description="Cancellation Finished Interrupt Enable 11" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CFIE12" description="Cancellation Finished Interrupt Enable 12" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CFIE13" description="Cancellation Finished Interrupt Enable 13" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CFIE14" description="Cancellation Finished Interrupt Enable 14" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CFIE15" description="Cancellation Finished Interrupt Enable 15" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CFIE16" description="Cancellation Finished Interrupt Enable 16" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CFIE17" description="Cancellation Finished Interrupt Enable 17" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CFIE18" description="Cancellation Finished Interrupt Enable 18" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CFIE19" description="Cancellation Finished Interrupt Enable 19" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CFIE20" description="Cancellation Finished Interrupt Enable 20" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CFIE21" description="Cancellation Finished Interrupt Enable 21" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CFIE22" description="Cancellation Finished Interrupt Enable 22" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CFIE23" description="Cancellation Finished Interrupt Enable 23" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="CFIE24" description="Cancellation Finished Interrupt Enable 24" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CFIE25" description="Cancellation Finished Interrupt Enable 25" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="CFIE26" description="Cancellation Finished Interrupt Enable 26" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="CFIE27" description="Cancellation Finished Interrupt Enable 27" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="CFIE28" description="Cancellation Finished Interrupt Enable 28" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="CFIE29" description="Cancellation Finished Interrupt Enable 29" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="CFIE30" description="Cancellation Finished Interrupt Enable 30" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="CFIE31" description="Cancellation Finished Interrupt Enable 31" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAN_TXEFC" width="32" page="1" offset="0xf0" internal="0" description="MCAN Tx Event FIFO Configuration">
		<bitfield id="EFSA" description="Event FIFO Start Address" begin="15" end="2" width="14" rwaccess="RW"/>
		<bitfield id="EFS" description="Event FIFO Size" begin="21" end="16" width="6" rwaccess="RW"/>
		<bitfield id="EFWM" description="Event FIFO Watermark" begin="29" end="24" width="6" rwaccess="RW"/>
	</register>
	<register id="MCAN_TXEFS" width="32" page="1" offset="0xf4" internal="0" description="MCAN Tx Event FIFO Status">
		<bitfield id="EFFL" description="Event FIFO Fill Level" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="EFGI" description="Event FIFO Get Index" begin="12" end="8" width="5" rwaccess="R"/>
		<bitfield id="EFPI" description="Event FIFO Put Index" begin="20" end="16" width="5" rwaccess="R"/>
		<bitfield id="EFF" description="Event FIFO Full" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="TEFL" description="Tx Event FIFO Element Lost" begin="25" end="25" width="1" rwaccess="R"/>
	</register>
	<register id="MCAN_TXEFA" width="32" page="1" offset="0xf8" internal="0" description="MCAN Tx Event FIFO Acknowledge">
		<bitfield id="EFAI" description="Event FIFO Acknowledge Index" begin="4" end="0" width="5" rwaccess="RW"/>
	</register>
</module>
